app/views/users/show.html.erb

  </div>
  <% @user.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 6]]

    <div class="span8 well">
      <% post.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "post_categories" ON "categories"."id" = "post_categories"."category_id" WHERE "post_categories"."post_id" = ?  [["post_id", 13]]

      <small><span class="quiet">posted at </small><%= time_tag post.created_at %>
      <br/><%= link_to "#{post.comments.size} comments", post %></small>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 13]]