app/views/shared/_edit_form.html.erb

	<%= f.label "Categories" %>
	<%= f.collection_check_boxes :category_ids, Category.all, :id, :name do |cb| %>
---
SELECT "categories".* FROM "categories"