app/views/posts/_show_post.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 13]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 13]]
---
    <%= render 'shared/show_user_link', obj: obj.creator %>
    <br/><%= link_to pluralize(obj.comments.size, 'comment'), obj %></small>