app/views/posts/index.html.erb

    <div class="span8 well">
	   	<% post.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "post_categories" ON "categories"."id" = "post_categories"."category_id" WHERE "post_categories"."post_id" = ?  [["post_id", 13]]

      <small>at <%= time_tag post.created_at %>
      <br/><%= link_to "#{post.comments.size} comments", post %></small>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 12]]