app/views/posts/show.html.erb


<% if @post.comments.size > 0 %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 7]]