app/views/posts/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "post_categories" ON "categories"."id" = "post_categories"."category_id" WHERE "post_categories"."post_id" = ?  [["post_id", 14]]
---
    <% end %></h3>
  <% @post.categories.each do |category| %>