app/controllers/categories_controller.rb

  def set_category
    @category = Category.find_by slug: params[:id]
---
SELECT "categories".* FROM "categories" WHERE "categories"."slug" = 'art' LIMIT 1