app/controllers/categories_controller.rb

	def create
 		@category = Category.new(post_params)
 		if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 14 Jul 2013 22:16:10 UTC +00:00], ["name", "Art"], ["updated_at", Sun, 14 Jul 2013 22:16:10 UTC +00:00]]