app/controllers/comments_controller.rb

INSERT INTO "comments" ("created_at", "description", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 14 Jul 2013 22:42:01 UTC +00:00], ["description", "Comment\r\n"], ["post_id", 14], ["updated_at", Sun, 14 Jul 2013 22:42:01 UTC +00:00]]
---
	def create
		@comment = @post.comments.build(post_params)
 		if @comment.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 1]]
---
  def set_post
    @post = Post.find(params[:post_id])