app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "13"]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 20 Jul 2013 15:16:24 UTC +00:00], ["updated_at", Sat, 20 Jul 2013 15:16:24 UTC +00:00], ["user_id", 6], ["vote", true], ["voteable_id", 13], ["voteable_type", "Comment"]]
---
  def vote
    @comment = Comment.find(params[:id])
    if (Vote.find_by user_id: current_user.id, voteable: @comment) == nil
      Vote.create(voteable: @comment, creator: current_user, vote: params[:vote])