app/controllers/posts_controller.rb

INSERT INTO "posts" ("description", "title", "url", "user_id") VALUES (?, ?, ?, ?)  [["description", "Sweet!"], ["title", "Crazy post"], ["url", "www.yes.com"], ["user_id", 1]]
---
 	def create
 		@post = Post.new(post_params)
    @post.creator = current_user
 		if @post.save

UPDATE "posts" SET "title" = ?, "url" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = 13  [["title", "Art"], ["url", "www.art.com"], ["description", "Cool art site"], ["updated_at", Sun, 14 Jul 2013 22:44:30 UTC +00:00]]
---
 	def update
 		if @post.update(post_params)

SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = 6 LIMIT 1
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Fri, 19 Jul 2013 00:37:41 UTC +00:00], ["updated_at", Fri, 19 Jul 2013 00:37:41 UTC +00:00], ["user_id", 6], ["vote", true], ["voteable_id", 13], ["voteable_type", "Post"]]
---
  def vote
    if (Vote.find_by user_id: current_user.id, voteable: @post) == nil
      Vote.create(voteable: @post, creator: current_user, vote: params[:vote])

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'magic' LIMIT 1
---
  def set_post
    @post = Post.find_by slug: params[:id]