app/controllers/users_controller.rb

INSERT INTO "users" ("password_digest", "username") VALUES (?, ?)  [["password_digest", "$2a$10$W8l3vWIQ2aI.zQlK8UqfdeiBB9mKA1EPFAUJ0A2LfvWNgms80BRRW"], ["username", "Heather"]]
---
  def create
    @user = User.new(post_params)
    if @user.save