app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."slug" = '6' LIMIT 1
---
  def show
    @user = User.find_by slug: params[:id]