app/views/categories/show.html.erb

  </div>
  <% @category.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" INNER JOIN "post_categories" ON "posts"."id" = "post_categories"."post_id" WHERE "post_categories"."category_id" = ?  [["category_id", 1]]

      <small>at <%= time_tag post.created_at %>
      <br/><%= link_to "#{post.comments.size} comments", post %></small>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 13]]